In [1]:
import numpy as np
import pandas as pd

In [2]:
data_dic = {'M':[1,2,np.nan,4,np.nan],
            'N':[11,12,13,14,15],
            'O':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'P':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic) # dataframe from a dic.
df

     M   N   O     P
0  1.0  11 NaN  16.0
1  2.0  12 NaN   NaN
2  NaN  13 NaN  18.0
3  4.0  14 NaN  19.0
4  NaN  15 NaN  20.0

In [3]:
missing_data = df.isna()
missing_data

       M      N     O      P
0  False  False  True  False
1  False  False  True   True
2   True  False  True  False
3  False  False  True  False
4   True  False  True  False

In [4]:
missing_data = df.isna().sum()
missing_data

M    2
N    0
O    5
P    1
dtype: int64

In [5]:
df_filled = df.fillna('N')
df_filled

     M   N  O     P
0  1.0  11  N  16.0
1  2.0  12  N     N
2    N  13  N  18.0
3  4.0  14  N  19.0
4    N  15  N  20.0

In [6]:
mean_M = df['M'].mean()
mean_M

2.3333333333333335

In [9]:
df['M'].fillna(mean_M,inplace=True)
df

          M   N   O     P
0  1.000000  11 NaN  16.0
1  2.000000  12 NaN   NaN
2  2.333333  13 NaN  18.0
3  4.000000  14 NaN  19.0
4  2.333333  15 NaN  20.0

In [16]:
df['M'].fillna(value = df['M'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: M, dtype: float64

In [17]:
df

          M   N   O     P
0  1.000000  11 NaN  16.0
1  2.000000  12 NaN   NaN
2  2.333333  13 NaN  18.0
3  4.000000  14 NaN  19.0
4  2.333333  15 NaN  20.0

In [18]:
df.fillna(method='ffill')

          M   N   O     P
0  1.000000  11 NaN  16.0
1  2.000000  12 NaN  16.0
2  2.333333  13 NaN  18.0
3  4.000000  14 NaN  19.0
4  2.333333  15 NaN  20.0

In [20]:
data_dict = {
    'key': ['a', 'b', 'c'],
    'A1': [0, 1, 2],
    'B1': [5, 6, 7],
    'A2': [0, 1, 2],
    'B2': [3, 4, 5]
}

df1 = pd.DataFrame(data_dict)
df1

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5

In [21]:
df.isnull().sum().sum()

6